mmoroni96/pmf_st/STM32_SD_SDMMC-master/Drivers/KSZ8851SNL/Inc/KSZ8851SNL_reg.h
/*
 * The MIT License (MIT)
 *
 * Copyright (c) [2018] [Marco Russi]
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

#ifndef __KSZ8851SNL_REG_H
#define __KSZ8851SNL_REG_H

#define REG_ADDR_MASK                 0x3F0       /* Register address mask */
#define OPCODE_MASK                   (3 << 14)
#define CMD_READ                      (0 << 14)
#define CMD_WRITE                     (1 << 14)
#define FIFO_READ                     0x80
#define FIFO_WRITE                    0xC0

#define MIB_MASK                      0x1C00

//Minimum Ethernet frame size
#define ETH_MIN_FRAME_SIZE            64
//Maximum Ethernet frame size
#define ETH_MAX_FRAME_SIZE            1518
//Ethernet maximum transmission unit
#define ETH_MTU                       1500
//Ethernet CRC field size
#define ETH_CRC_SIZE                  4

/* Register definitions */
#define MARL                          0x10
#define MARM                          0x12
#define MARH                          0x14
#define OBCR                          0x20
#define EEPCR                         0x22
#define MBIR                          0x24
#define GRR                           0x26
#define WFCR                          0x2A
#define TXCR                          0x70
#define RXCR1                         0x74
#define RXCR2                         0x76
#define TXMIR                         0x78
#define RXFHSR                        0x7C
#define RXFHBCR                       0x7E
#define TXQCR                         0x80
#define RXQCR                         0x82
#define TXFDPR                        0x84
#define RXFDPR                        0x86
#define IER                           0x90
#define ISR                           0x92
#define RXFCTR                        0x9C
#define TXNTFSR                       0x9E
#define FCLWR                         0xB0
#define FCHWR                         0xB2
#define CIDER                         0xC0
#define IACR                          0xC8
#define IADLR                         0xD0
#define IADHR                         0xD2
#define PMECR                         0xD4
#define PHYRR                         0xD8
#define P1MBCR                        0xE4
#define P1CR                          0xF6
#define P1SR                          0xF8

/*
 * MAC Registers
 * (Offset 0x00 - 0x25)
 */
#define REG_BUS_ERROR_STATUS          0x06        /* BESR */
#define BUS_ERROR_IBEC                0x8000
#define BUS_ERROR_IBECV_MASK          0x7800      /* Default IPSec clock at 166Mhz */

#define REG_CHIP_CFG_STATUS           0x08        /* CCFG */
#define LITTLE_ENDIAN_BUS_MODE        0x0400      /* Bus in little endian mode */
#define EEPROM_PRESENCE               0x0200      /* External EEPROM is used */
#define SPI_BUS_MODE                  0x0100      /* In SPI bus mode */
#define DATA_BUS_8BIT                 0x0080      /* In 8-bit bus mode operation */
#define DATA_BUS_16BIT                0x0040      /* In 16-bit bus mode operation */
#define DATA_BUS_32BIT                0x0020      /* In 32-bit bus mode operation */
#define MULTIPLEX_MODE                0x0010      /* Data and address bus are shared */
#define CHIP_PACKAGE_128PIN           0x0008      /* 128-pin package */
#define CHIP_PACKAGE_80PIN            0x0004      /* 80-pin package */
#define CHIP_PACKAGE_48PIN            0x0002      /* 48-pin package */
#define CHIP_PACKAGE_32PIN            0x0001      /* 32-pin package for SPI host interface only */

#define REG_MAC_ADDR_0                MARL        /* MARL 0x10 */
#define REG_MAC_ADDR_1                (MARL + 1)  /* MARL 0x10 + 1 */
#define REG_MAC_ADDR_2                MARM        /* MARM 0x12 */
#define REG_MAC_ADDR_3                (MARM + 1)  /* MARM 0x12 + 1*/
#define REG_MAC_ADDR_4                MARH        /* MARH 0x14 */
#define REG_MAC_ADDR_5                (MARH + 1)  /* MARH 0x14 + 1*/

#define OBC_REG                       OBCR        /* On-Chip Bus Control Register */
#define REG_BUS_CLOCK_CTRL            OBCR        /* OBCR */
#define BUS_CLOCK_166                 0x0004      /* 166 MHz on-chip bus clock (defaul is 125MHz) */
#define BUS_CLOCK_DIVIDEDBY_5         0x0003      /* Bus clock devided by 5 */
#define BUS_CLOCK_DIVIDEDBY_3         0x0002      /* Bus clock devided by 3 */
#define BUS_CLOCK_DIVIDEDBY_2         0x0001      /* Bus clock devided by 2 */
#define BUS_CLOCK_DIVIDEDBY_1         0x0000      /* Bus clock devided by 1 */
#define BUS_CLOCK_DIVIDED_MASK        0x0003      /* Bus clock devider mask */

#define BUS_SPEED_166_MHZ             0x0004      /* Set bus speed to 166 MHz */
#define BUS_SPEED_125_MHZ             0x0000      /* Set bus speed to 125 MHz */
#define BUS_SPEED_83_MHZ              0x0005      /* Set bus speed to 83 MHz (166/2)*/
#define BUS_SPEED_62_5_MHZ            0x0001      /* Set bus speed to 62.5 MHz (125/2) */
#define BUS_SPEED_53_3_MHZ            0x0006      /* Set bus speed to 53.3 MHz (166/3) */
#define BUS_SPEED_41_7_MHZ            0x0002      /* Set bus speed to 41.67 MHz (125/3) */
#define BUS_SPEED_33_2_MHZ            0x0007      /* Set bus speed to 33.2 MHz (166/5) */
#define BUS_SPEED_25_MHZ              0x0003      /* Set bus speed to 25 MHz (125/5) */

#define REG_EEPROM_CTRL               0x22        /* EEPCR */
#define EEPROM_ACCESS_ENABLE          0x0010      /* Enable software to access EEPROM through bit 3 to bit 0 */
#define EEPROM_DATA_IN                0x0008      /* Data receive from EEPROM (EEDI pin) */
#define EEPROM_DATA_OUT               0x0004      /* Data transmit to EEPROM (EEDO pin) */
#define EEPROM_SERIAL_CLOCK           0x0002      /* Serial clock (EESK pin) */
#define EEPROM_CHIP_SELECT            0x0001      /* EEPROM chip select (EECS pin) */

#define REG_MEM_BIST_INFO             0x24        /* MBIR */
#define TX_MEM_TEST_FINISHED          0x1000      /* TX memeory BIST test finish */
#define TX_MEM_TEST_FAILED            0x0800      /* TX memory BIST test fail */
#define TX_MEM_TEST_FAILED_COUNT      0x0700      /* TX memory BIST test fail count */
#define RX_MEM_TEST_FINISHED          0x0010      /* RX memory BIST test finish */
#define RX_MEM_TEST_FAILED            0x0008      /* RX memory BIST test fail */
#define RX_MEM_TEST_FAILED_COUNT      0x0003      /* RX memory BIST test fail count */

