mmoroni96/pmf_st/STM32_SD_SDMMC-master/Drivers/KSZ8851SNL/Inc/KSZ8851SNL_reg.h
/* RXQ Command Register Options */
#define RXQ_ON_TIME_INT               0x1000      /* RX interrupt is occured on timer duration */
#define RXQ_ON_BYTE_CNT_INT           0x0800      /* RX interrupt is occured on byte count threshold */
#define RXQ_ON_FRAME_CNT_INT          0x0400      /* RX interrupt is occured on frame count threshold */
#define RXQ_TWOBYTE_OFFSET            0x0200      /* Enable adding 2-bytes offset before IP frame header */
#define RXQ_EN_ON_TIME_INT            0x0080      /* Enable RX interrupt on timer duration */
#define RXQ_EN_ON_BYTE_CNT_INT        0x0040      /* Enable RX interrupt on byte count threshold */
#define RXQ_EN_ON_FRAME_CNT_INT       0x0020      /* Enable RX interrupt on frame count threshold */
#define RXQ_AUTO_DEQUEUE              0x0010      /* Enable Auto Dequeue RXQ Frame */
#define RXQ_START_DMA                 0x0008      /* Start QMU transfer operation */
#define RXQ_RELEASE_ERROR_FRAME       0x0001      /* Release RX Error Frame */

/** RX COMMAND Initialization collection */
#define   RXQ_CMD_CONFIG              (RXQ_EN_ON_FRAME_CNT_INT | \
    RXQ_AUTO_DEQUEUE)
/** RX COMMAND Initialization collection */
#define   RXQ_CMD_EXAMPLE             (RXQ_EN_ON_FRAME_CNT_INT | \
    RXQ_TWOBYTE_OFFSET |      \
    RXQ_AUTO_DEQUEUE)

//#define RXQ_CMD_CNTL                  (RXQ_FRAME_CNT_INT|RXQ_AUTO_DEQUEUE)

#define TX_FD_PTR_REG                 0x84        /* TX Frame Data Pointer Register */
#define REG_TX_ADDR_PTR               0x84        /* TXFDPR */
#define TXFDPR_TXFPAI                 (1 << 14)
#define TXFDPR_TXFP_MASK              (0x7ff << 0)
#define TXFDPR_TXFP_SHIFT             (0)

#define RX_FD_PTR_REG                 RXFDPR      /* RXFDPR - RX Frame Data Pointer Register */
#define REG_RX_ADDR_PTR               RXFDPR      /* RXFDPR - RX Frame Data Pointer Register*/
#define RXFDPR_RXFPAI                 (1 << 14)
#define ADDR_PTR_AUTO_INC             0x4000      /* Enable Frame data pointer increments automatically */
#define ADDR_PTR_MASK                 0x03ff      /* Address pointer mask */

#define REG_RX_TIME_THRES             0x8C        /* RXDTTR */
#define RX_TIME_THRESHOLD_MASK        0xFFFF      /* Set receive timer duration threshold */

#define REG_RX_BYTE_CNT_THRES         0x8E        /* RXDBCTR */
#define RX_BYTE_THRESHOLD_MASK        0xFFFF      /* Set receive byte count threshold */

#define INT_ENABLE_REG                0x90        /* Interrupt Enable Register */
#define REG_INT_MASK                  0x90        /* IER */
#define REG_INT_ENABLE                0x90        /* IER */
#define INT_PHY                       0x8000      /* Enable link change interrupt */
#define INT_TX                        0x4000      /* Enable transmit done interrupt */
#define INT_RX                        0x2000      /* Enable receive interrupt */
#define INT_RX_OVERRUN                0x0800      /* Enable receive overrun interrupt */
#define INT_TX_STOPPED                0x0200      /* Enable transmit process stopped interrupt */
#define INT_RX_STOPPED                0x0100      /* Enable receive process stopped interrupt */
#define INT_TX_SPACE                  0x0040      /* Enable transmit space available interrupt */
#define INT_RX_WOL_FRAME              0x0020      /* Enable WOL on receive wake-up frame detect interrupt */
#define INT_RX_WOL_MAGIC              0x0010      /* Enable WOL on receive magic packet detect interrupt */
#define INT_RX_WOL_LINKUP             0x0008      /* Enable WOL on link up detect interrupt */
#define INT_RX_WOL_ENERGY             0x0004      /* Enable WOL on energy detect interrupt */
#define INT_RX_SPI_ERROR              0x0002      /* Enable receive SPI bus error interrupt */
#define INT_RX_WOL_DELAY_ENERGY       0x0001      /* Enable WOL on delay energy detect interrupt */
#define INT_MASK                      ( INT_RX | INT_TX | INT_PHY )
#define INT_NO_INT                    0x0000

/* Interrupt Enable Register Options */
#define   INT_LINK_CHANGE             0x8000      /* Enable link change interrupt */
#define   INT_TX_DONE                 0x4000      /* Enable transmit done interrupt */
#define   INT_RX_DONE                 0x2000      /* Enable receive interrupt */
#define   INT_RX_OVERRUN              0x0800      /* Enable receive overrun interrupt */
#define   INT_TX_STOPPED              0x0200      /* Enable transmit process stopped interrupt */
#define   INT_RX_STOPPED              0x0100      /* Enable receive process stopped interrupt */
#define   INT_TX_SPACE                0x0040      /* Enable transmit space available interrupt */
#define   INT_RX_WOL_FRAME            0x0020      /* Enable WOL on receive wake-up frame detect interrupt */
#define   INT_MAGIC                   0x0010      /* Enable magic packet detect interrupt */
#define   INT_LINKUP                  0x0008      /* Enable link up detect interrupt */
#define   INT_ENERGY                  0x0004      /* Enable detect interrupt */
#define   INT_SPI_ERROR               0x0002      /* Enable receive SPI bus error interrupt */

/** Interrupt mask initialization collection */
#define INT_MASK_EXAMPLE              (KSZ8851SNL_INT_RX_DONE |    \
    KSZ8851SNL_INT_RX_OVERRUN | \
    KSZ8851SNL_INT_TX_STOPPED | \
    KSZ8851SNL_INT_RX_STOPPED | \
    KSZ8851SNL_INT_TX_DONE |    \
    KSZ8851SNL_INT_LINK_CHANGE | \
    INT_LINKUP)

/* Interrupt Enable Register Options */
#define KSZ8851SNL_INT_LINK_CHANGE          0x8000  /* Enable link change interrupt */
#define KSZ8851SNL_INT_TX_DONE              0x4000  /* Enable transmit done interrupt */
#define KSZ8851SNL_INT_RX_DONE              0x2000  /* Enable receive done interrupt */
#define KSZ8851SNL_INT_RX_OVERRUN           0x0800  /* Enable receive overrun interrupt */
#define KSZ8851SNL_INT_TX_STOPPED           0x0200  /* Enable transmit process stopped interrupt */
#define KSZ8851SNL_INT_RX_STOPPED           0x0100  /* Enable receive process stopped interrupt */
#define KSZ8851SNL_INT_TX_SPACE             0x0040  /* Enable transmit space available interrupt */
#define KSZ8851SNL_INT_RX_WOL_FRAME         0x0020  /* Enable WOL on receive wake-up frame detect interrupt */
#define KSZ8851SNL_INT_RX_WOL_MAGIC         0x0010  /* Enable magic packet detect interrupt */
#define KSZ8851SNL_INT_RX_WOL_LINKUP        0x0008  /* Enable link up detect interrupt */
#define KSZ8851SNL_INT_RX_WOL_ENERGY        0x0004  /* Enable detect interrupt */
#define KSZ8851SNL_INT_RX_SPI_ERROR         0x0002  /* Enable receive SPI bus error interrupt */
#define KSZ8851SNL_INT_RX_WOL_DELAY_ENERGY  0x0001
#define KSZ8851SNL_INT_ENABLE_MASK          (KSZ8851SNL_INT_RX_DONE | \
    KSZ8851SNL_INT_RX_STOPPED | \
    KSZ8851SNL_INT_TX_STOPPED | \
    KSZ8851SNL_INT_LINK_CHANGE | \
    KSZ8851SNL_INT_RX_SPI_ERROR)

#define INT_STATUS_REG                0x92        /* Interrupt Status Register */
#define REG_INT_STATUS                0x92        /* ISR */

