mmoroni96/pmf_st/STM32_SD_SDMMC-master/Drivers/KSZ8851SNL/Inc/KSZ8851SNL_reg.h
#define REG_WAKEUP_TIME               0xD6        /* GSWUTR */
#define WAKEUP_TIME                   0xFF00      /* Min time (sec) wake-uo after detected energy */
#define GOSLEEP_TIME                  0x00FF      /* Min time (sec) before goto sleep when in energy mode */

/*
 * PHY Control Registers
 * (Offset 0xD8 - 0xF9)
 */
#define PHY_RST_REG                   0xD8        /* PHY Reset Register  */
#define REG_PHY_RESET                 0xD8        /* PHYRR */
#define PHY_RESET_REG_VALUE           0x0001      /* Reset PHY */

#define PHY1_CTRL_REG                 0xE4        /* PHY1 MII-Register Basic Control Register */
#define REG_PHY_CNTL                  0xE4        /* P1MBCR */
#define PHY_SPEED_100MBIT             0x2000      /* Force PHY 100Mbps */
#define PHY_AUTO_NEG_ENABLE           0x1000      /* Enable PHY auto-negotiation */
#define PHY_POWER_DOWN                0x0800      /* Set PHY power-down */
#define PHY_AUTO_NEG_RESTART          0x0200      /* Restart PHY auto-negotiation */
#define PHY_FULL_DUPLEX               0x0100      /* Force PHY in full duplex mode */
#define PHY_HP_MDIX                   0x0020      /* Set PHY in HP auto MDI-X mode */
#define PHY_FORCE_MDIX                0x0010      /* Force MDI-X */
#define PHY_AUTO_MDIX_DISABLE         0x0008      /* Disable auto MDI-X */
#define PHY_TRANSMIT_DISABLE          0x0002      /* Disable PHY transmit */
#define PHY_LED_DISABLE               0x0001      /* Disable PHY LED */

#define REG_PHY_STATUS                0xE6        /* P1MBSR */
#define PHY_100BT4_CAPABLE            0x8000      /* 100 BASE-T4 capable */
#define PHY_100BTX_FD_CAPABLE         0x4000      /* 100BASE-TX full duplex capable */
#define PHY_100BTX_CAPABLE            0x2000      /* 100BASE-TX half duplex capable */
#define PHY_10BT_FD_CAPABLE           0x1000      /* 10BASE-TX full duplex capable */
#define PHY_10BT_CAPABLE              0x0800      /* 10BASE-TX half duplex capable */
#define PHY_AUTO_NEG_ACKNOWLEDGE      0x0020      /* Auto-negotiation complete */
#define PHY_AUTO_NEG_CAPABLE          0x0008      /* Auto-negotiation capable */
#define PHY_LINK_UP                   0x0004      /* PHY link is up */
#define PHY_EXTENDED_CAPABILITY       0x0001      /* PHY extended register capable */

#define REG_PHY_ID_LOW                0xE8        /* PHY1ILR */
#define REG_PHY_ID_HIGH               0xEA        /* PHY1IHR */

#define REG_PHY_AUTO_NEGOTIATION      0xEC        /* P1ANAR */
#define PHY_AUTO_NEG_SYM_PAUSE        0x0400      /* Advertise pause capability */
#define PHY_AUTO_NEG_100BTX_FD        0x0100      /* Advertise 100 full-duplex capability */
#define PHY_AUTO_NEG_100BTX           0x0080      /* Advertise 100 half-duplex capability */
#define PHY_AUTO_NEG_10BT_FD          0x0040      /* Advertise 10 full-duplex capability */
#define PHY_AUTO_NEG_10BT             0x0020      /* Advertise 10 half-duplex capability */
#define PHY_AUTO_NEG_SELECTOR         0x001F      /* Selector field mask */
#define PHY_AUTO_NEG_802_3            0x0001      /* 802.3 */

#define REG_PHY_REMOTE_CAPABILITY     0xEE        /* P1ANLPR */
#define PHY_REMOTE_SYM_PAUSE          0x0400      /* Link partner pause capability */
#define PHY_REMOTE_100BTX_FD          0x0100      /* Link partner 100 full-duplex capability */
#define PHY_REMOTE_100BTX             0x0080      /* Link partner 100 half-duplex capability */
#define PHY_REMOTE_10BT_FD            0x0040      /* Link partner 10 full-duplex capability */
#define PHY_REMOTE_10BT               0x0020      /* Link partner 10 half-duplex capability */

#define REG_PORT_LINK_MD              0xF4        /* P1SCLMD */
#define PORT_CABLE_10M_SHORT          0x8000      /* Cable length is less than 10m short */
#define PORT_CABLE_STAT_FAILED        0x6000      /* Cable diagnostic test fail */
#define PORT_CABLE_STAT_SHORT         0x4000      /* Short condition detected in the cable */
#define PORT_CABLE_STAT_OPEN          0x2000      /* Open condition detected in the cable */
#define PORT_CABLE_STAT_NORMAL        0x0000      /* Normal condition */
#define PORT_CABLE_DIAG_RESULT        0x6000      /* Cable diagnostic test result mask */
#define PORT_START_CABLE_DIAG         0x1000      /* Enable cable diagnostic test */
#define PORT_FORCE_LINK               0x0800      /* Enable force link pass */
#define PORT_POWER_SAVING             0x0400      /* Disable power saving */
#define PORT_REMOTE_LOOPBACK          0x0200      /* Enable remote loopback at PHY */
#define PORT_CABLE_FAULT_COUNTER      0x01FF      /* Cable length distance to the fault */

#define PORT1_CTRL_REG                0xF6        /* Port 1 Control Register */
#define REG_PORT_CTRL                 0xF6        /* P1CR */
#define PORT_LED_OFF                  0x8000      /* Turn off all the port LEDs (LED3/LED2/LED1/LED0) */
#define PORT_TX_DISABLE               0x4000      /* Disable port transmit */
#define PORT_AUTO_NEG_RESTART         0x2000      /* Restart auto-negotiation */
#define PORT_POWER_DOWN               0x0800      /* Set port power-down */
#define PORT_AUTO_MDIX_DISABLE        0x0400      /* Disable auto MDI-X */
#define PORT_FORCE_MDIX               0x0200      /* Force MDI-X */
#define PORT_AUTO_NEG_ENABLE          0x0080      /* Enable auto-negotiation */
#define PORT_FORCE_100_MBIT           0x0040      /* Force PHY 100Mbps */
#define PORT_FORCE_FULL_DUPLEX        0x0020      /* Force PHY in full duplex mode */
#define PORT_AUTO_NEG_SYM_PAUSE       0x0010      /* Advertise pause capability */
#define PORT_AUTO_NEG_100BTX_FD       0x0008      /* Advertise 100 full-duplex capability */
#define PORT_AUTO_NEG_100BTX          0x0004      /* Advertise 100 half-duplex capability */
#define PORT_AUTO_NEG_10BT_FD         0x0002      /* Advertise 10 full-duplex capability */
#define PORT_AUTO_NEG_10BT            0x0001      /* Advertise 10 half-duplex capability */

#define REG_PORT_STATUS               0xF8        /* P1SR */
#define PORT_HP_MDIX                  0x8000      /* Set PHY in HP auto MDI-X mode */
#define PORT_REVERSED_POLARITY        0x2000      /* Polarity is reversed */
#define PORT_RX_FLOW_CTRL             0x1000      /* Reeive flow control feature is active */
#define PORT_TX_FLOW_CTRL             0x0800      /* Transmit flow control feature is active */
#define PORT_STAT_SPEED_100MBIT       0x0400      /* Link is 100Mbps */
#define PORT_STAT_FULL_DUPLEX         0x0200      /* Link is full duplex mode */
#define PORT_MDIX_STATUS              0x0080      /* Is MDI */
#define PORT_AUTO_NEG_COMPLETE        0x0040      /* Auto-negotiation complete */
#define PORT_STATUS_LINK_GOOD         0x0020      /* PHY link is up */
#define PORT_REMOTE_SYM_PAUSE         0x0010      /* Link partner pause capability */
#define PORT_REMOTE_100BTX_FD         0x0008      /* Link partner 100 full-duplex capability */
#define PORT_REMOTE_100BTX            0x0004      /* Link partner 100 half-duplex capability */
#define PORT_REMOTE_10BT_FD           0x0002      /* Link partner 10 full-duplex capability */
#define PORT_REMOTE_10BT              0x0001      /* Link partner 10 half-duplex capability */

/* Magic numbers */
#define KSZ8851SNL_CHIP_ID            0x8870      /* Default Chip ID for KSZ8851SNL */
#define CHIP_ID_MASK                  0xFFF0      /* Used to mask the revision ID */
#define ONE_FRAME_THRES               0x0001      /* RX INT after one frame */
#define FD_PTR_AUTO_INC               0x4000      /* Used to reset the FD pointer */
#define CLEAR_INT                     0xFFFF      /* Used to clear INT_STATUS_REG */
#define NO_INT                        0x0000      /* Used to disable the interupts */
#define TX_MEM_AVAIL_MASK             0x1FFF      /* Used to mask the reserved bits */
#define FRAME_ID_MASK                 0x003F      /* Used to mask the reserved bits */
#define CHECKSUM_VALID_FRAME_MASK     0x3C17      /* CRC OK for ICMP, IP, TCP, UDP; /
                                                   * MII error; /
                                                   * Frame too long error */
#define RECEIVE_VALID_FRAME_MASK      0x3C17      /* CRC OK for ICMP, IP, TCP, UDP; /
                                                   * MII error; /
                                                   * Frame too long error */
#define RX_BYTE_CNT_MASK              0x0FFF      /* Used to mask the reserved bits */
#define LSB_MASK                      0x00FF      /* Used to mask the LSB */
#define MSB_POS                       8           /* Used to mark the MSB pos */
#define TX_INT_on_COMPLETION          0x8000      /* TX INT on completion */
#define WORD_SIZE                     0x0004      /* Word size in # of bytes */
#define EXTRA_SIZE                    0x0008      /* Needed for the frame header */
#define BLOCKING_RECEIVE              0           /* Determines if receive will block */
#define WATERMARK_6KB                 0x0600      /* 6KByte Watermark */
#define WATERMARK_4KB                 0x0400      /* 4KByte Watermark */
#define RECEIVED_FRAME_VALID_POS      0x0010      /* Received valid frame byte pos */

/* Silicon Laboratories MAC address space */
//#define HIGH_QMU_MAC_H               0x00
//#define HIGH_QMU_MAC_L               0x0B
//#define MID_QMU_MAC_H                0x57
/* Energy Micro's MAC address space */
#define HIGH_QMU_MAC_H                0xD0        /* 1st segment of the MAC address */
#define HIGH_QMU_MAC_L                0xCF        /* 2nd segment of the MAC address */
#define MID_QMU_MAC_H                 0x5E        /* 3rd segment of the MAC address */
#define MID_QMU_MAC_L                 0x00        /* 4th segment of the MAC address */
#define LOW_QMU_MAC_H                 0x00        /* 5th segment of the MAC address */
#define LOW_QMU_MAC_L                 0x00        /* 6th segment of the MAC address */
#define BYTE_MASK                     0x00FF      /* Used to mask the LSB */
#define BYTE_SIZE                     0x0008      /* Used to mark the MSB pos */

