mmoroni96/pmf_st/STM32_SD_SDMMC-master/Drivers/KSZ8851SNL/Inc/KSZ8851SNL_reg.h
/* TX Flow Control Register Options */
#define TX_FLOW_CTRL_ICMP_CHECKSUM    0x0100      /* Enable Transmit Checksum Generation for ICMP */
#define TX_FLOW_CTRL_UDP_CHECKSUM     0x0080      /* Enable Transmit Checksum Generation for UDP */
#define TX_FLOW_CTRL_TCP_CHECKSUM     0x0040      /* Enable Transmit Checksum Generation for TCP */
#define TX_FLOW_CTRL_IP_CHECKSUM      0x0020      /* Enable Transmit Checksum Generation for IP */
#define TX_FLOW_CTRL_FLUSH_QUEUE      0x0010      /* Flush Transmit Queue */
#define TX_FLOW_CTRL_FLOW_ENABLE      0x0008      /* Transmit flow control enable*/
#define TX_FLOW_CTRL_PAD_ENABLE       0x0004      /* Transmit Padding enable */
#define TX_FLOW_CTRL_CRC_ENABLE       0x0002      /* Transmit CRC Enable */
#define TX_FLOW_CTRL_ENABLE           0x0001      /* Enable transmit */
/** TX FLOW CONTROL Initialization collection */
#define TX_FLOW_CTRL_CONFIG           (TX_FLOW_CTRL_ICMP_CHECKSUM | \
    TX_FLOW_CTRL_UDP_CHECKSUM  |  \
    TX_FLOW_CTRL_TCP_CHECKSUM  | \
    TX_FLOW_CTRL_IP_CHECKSUM   | \
    TX_FLOW_CTRL_FLOW_ENABLE   | \
    TX_FLOW_CTRL_PAD_ENABLE    | \
    TX_FLOW_CTRL_CRC_ENABLE)

/* TXQ Command Register Options */
#define TXQ_AUTO_ENQUEUE              0x0004      /* Enable Auto-Enqueue TXQ Frame */
#define TXQ_MEM_AVAILABLE_INT         0x0002      /* Enable INT generation when TXQ Memory Available */
#define TXQ_ENQUEUE                   0x0001      /* Enable Manual Engueue TXQ Frame */

/* RX Flow Control Register 1 Options */
#define RX_FLOW_CTRL_FLUSH_QUEUE      0x8000      /* Flush Receive Queue */
#define RX_FLOW_CTRL_UDP_CHECKSUM     0x4000      /* Enable Receive UDP Frame Checksum Check */
#define RX_FLOW_CTRL_TCP_CHECKSUM     0x2000      /* Enable Receive TCP Frame Checksum Check */
#define RX_FLOW_CTRL_IP_CHECKSUM      0x1000      /* Enable Receive IP Frame Checksum Check */
#define RX_FLOW_CTRL_MAC_FILTER       0x0800      /* Receive Physical Address Filtering with MAC Address Enable */
#define RX_FLOW_CTRL_FLOW_ENABLE      0x0400      /* Enable Receive Flow Control */
#define RX_FLOW_CTRL_BAD_PACKET       0x0200      /* Enable Receive Error Frames */
#define RX_FLOW_CTRL_MULTICAST        0x0100      /* Receive Multicast Address Filtering with MAC Address Enable */
#define RX_FLOW_CTRL_BROADCAST_ENABLE 0x0080      /* Enable Receive Broadcast frames */
#define RX_FLOW_CTRL_MULTICAST_ENABLE 0x0040      /* Enable Receive Multicast frames */
#define RX_FLOW_CTRL_UNICAST_ENABLE   0x0020      /* Enable Receive Unicast frames */
#define RX_FLOW_CTRL_PROMISCUOUS_MODE 0x0012      /* Receive all incoming frames */
#define RX_FLOW_CTRL_RX_ALL           0x0010
#define RX_FLOW_CTRL_INVERSE_FILTER   0x0002      /* Receive Inverse Filtering */
#define RX_FLOW_CTRL_RX_ENABLE        0x0001      /* Enable receive */
/** RX FLOW CONTROL1 Initialization collection */
#define RX_FLOW_CTRL1_CONFIG          (RX_FLOW_CTRL_UDP_CHECKSUM     | \
    RX_FLOW_CTRL_TCP_CHECKSUM     | \
    RX_FLOW_CTRL_IP_CHECKSUM      | \
    RX_FLOW_CTRL_MAC_FILTER       | \
    RX_FLOW_CTRL_FLOW_ENABLE      | \
    RX_FLOW_CTRL_BROADCAST_ENABLE | \
    RX_FLOW_CTRL_MULTICAST_ENABLE | \
    RX_FLOW_CTRL_UNICAST_ENABLE)

/* RX Flow Control Register 2 Options */
/* SPI Receive Data Burst Length */
#define   RX_FLOW_CTRL_BURST_LEN_MASK     0x00E0  /* Receive Flow Control Burst Length mask */
#define   RX_FLOW_CTRL_BURST_LEN_4        0x0000  /* 4 bytes length */
#define   RX_FLOW_CTRL_BURST_LEN_8        0x0020  /* 8 Bytes length */
#define   RX_FLOW_CTRL_BURST_LEN_16       0x0040  /* 16 Bytes length */
#define   RX_FLOW_CTRL_BURST_LEN_32       0x0060  /* 32 Bytes length */
#define   RX_FLOW_CTRL_BURST_LEN_FRAME    0x0080  /* Full frame length */
#define   RX_FLOW_CTRL_IPV6_UDP_FRAG_PASS 0x0010  /* IPV4/IPV6/UDP Fragment Frame Pass */
#define   RX_FLOW_CTRL_IPV6_UDP_ZERO_PASS 0x0008  /* IPV4/IPV6/UDP Frame Checksum Equal Zero */
#define   RX_FLOW_CTRL_UDP_LITE_CHECKSUM  0x0004  /* Enable UDP Lite frame */
#define   RX_FLOW_CTRL_ICMP_CHECKSUM      0x0002  /* Enable ICMP frame */
#define   RX_FLOW_CTRL_BLOCK_MAC          0x0001  /* Receive Source Address Filtering */
/** RX FLOW CONTROL2 Initialization collection */
#define   RX_FLOW_CTRL2_CONFIG              (RX_FLOW_CTRL_IPV6_UDP_FRAG_PASS | \
    RX_FLOW_CTRL_UDP_LITE_CHECKSUM |  \
    RX_FLOW_CTRL_ICMP_CHECKSUM |      \
    RX_FLOW_CTRL_BURST_LEN_FRAME)

/* Port 1 Status Register */
#define PORT1_AN_DONE                     0x0040
#define PORT1_LINK_GOOD                   0x0020

/* Port 1 Control Register Options */
#define   PORT1_LED_OFF                   0x8000  /* Turn off port LEDs */
#define   PORT1_TX_DISABLE                0x4000  /* Disable port transmit */
#define   PORT1_AUTO_NEG_RESTART          0x2000  /* Restart auto-negotiation */
#define   PORT1_POWER_DOWN                0x0800  /* Set port power-down */
#define   PORT1_AUTO_MDIX_DISABLE         0x0400  /* Disable auto MDI/MDI-X */
#define   PORT1_FORCE_MDIX                0x0200  /* Force MDI-X */
#define   PORT1_AUTO_NEG_ENABLE           0x0080  /* Enable auto-negotiation */
#define   PORT1_FORCE_100_MBIT            0x0040  /* Force PHY 100Mbps */
#define   PORT1_FORCE_FULL_DUPLEX         0x0020  /* Force PHY in full duplex mode */
#define   PORT1_AUTO_NEG_FLOW_CTRL        0x0010  /* Advertise flow control capability */
#define   PORT1_AUTO_NEG_SYM_PAUSE        0x0010  /* Advertise flow control capability */
#define   PORT1_AUTO_NEG_100BTX_FD        0x0008  /* Advertise 100BT full-duplex capability */
#define   PORT1_AUTO_NEG_100BTX           0x0004  /* Advertise 100BT half-duplex capability */
#define   PORT1_AUTO_NEG_10BT_FD          0x0002  /* Advertise 10BT full-duplex capability  */
#define   PORT1_AUTO_NEG_10BT             0x0001  /* Advertise 10BT half-duplex capability  */

/* Port 1 Control Register Options Initialization collection */
#define   PORT1_CONFIG                (PORT1_AUTO_NEG_ENABLE    | \
    PORT1_FORCE_100_MBIT     | \
    PORT1_FORCE_FULL_DUPLEX  | \
    PORT1_AUTO_NEG_FLOW_CTRL | \
    PORT1_AUTO_NEG_100BTX_FD | \
    PORT1_AUTO_NEG_100BTX    | \
    PORT1_AUTO_NEG_10BT_FD   | \
    PORT1_AUTO_NEG_10BT      )

