mmoroni96/pmf_st/STM32_SD_SDMMC-master/Drivers/KSZ8851SNL/Inc/KSZ8851SNL_reg.h
/* Global Reset Register Options */
#define QMU_MODULE_SOFT_RESET         0x0002      /* QMU Reset */
#define GLOBAL_SOFT_RESET             0x0001      /* Global reset */
#define PHY_RESET                     0x0001      /* PHY Reset Register Options */
/* P1MBCR register */
#define DIGITAL_LOOPBACK              0x4000      /* Enable Digital loopback mode */
#define FORCE_100                     0x2000      /* Force the speed to 100MBps */
#define AUTO_NEG                      0x1000      /* Force auto negotiation */
#define RESTART_AUTO_NEG              0x0200      /* Restart auto negotiation */
#define FORCE_FULL_DUPLEX             0x0100      /* Force full duplex */

#define TX_MEMORY_WAIT_MS             500
#define FRAME_COUNT_THRESHOLD         1

/* Management information base registers */
#define MIB_MASK                      0x1C00      /* MIB Mask */
#define MIB_RxByte                    0x00        /* # of received bytes */
#define MIB_XXX                       0x01        /* MIB Reserved byte */
#define MIB_RxUndersizePkt            0x02        /* # of received undersized packets */
#define MIB_RxFragments               0x03        /* # of received fragments */
#define MIB_RxOversize                0x04        /* # of received oversized packets */
#define MIB_RxJabbers                 0x05        /* # of received jabbers */
#define MIB_RxSymbolError             0x06        /* # of received error symbols */
#define MIB_RxCRCError                0x07        /* # of received packets with CRC error */
#define MIB_RxAlignmentError          0x08        /* # of received missaligned packets */
#define MIB_RxControl8808Pkts         0x09        /* # of received control packets */
#define MIB_RxPausePkts               0x0A        /* # of received pause packets */
#define MIB_RxBroadcast               0x0B        /* # of received broadcast packets */
#define MIB_RxMulticast               0x0C        /* # of received multicast packets */
#define MIB_RxUnicast                 0x0D        /* # of received unicast packets */
#define MIB_Rx64Octets                0x0E        /* # of received packets with size of 64 bytes */
#define MIB_Rx65to127Octets           0x0F        /* # of received packets with size between 65 and 127 bytes */
#define MIB_Rx128to255Octets          0x10        /* # of received packets with size between 128 and 255 bytes */
#define MIB_Rx256to511Octets          0x11        /* # of received packets with size between 256 and 511 bytes */
#define MIB_Rx512to1023Octets         0x12        /* # of received packets with size between 512 and 1023 bytes */
#define MIB_Rx1024to1521Octets        0x13        /* # of received packets with size between 1024 and 1521 bytes */
#define MIB_Rx1522to2000Octets        0x14        /* # of received packets with size between 1522 and 2000 bytes */
#define MIB_TxByte                    0x15        /* # of transmitted bytes */
#define MIB_TxLateCollision           0x16        /* # of transmitted late collision packets */
#define MIB_TxPausePkts               0x17        /* # of transmitted pause packets */
#define MIB_TxBroadcastPkts           0x18        /* # of transmitted broadcast packets */
#define MIB_TxMulticastPkts           0x19        /* # of transmitted multicast packets */
#define MIB_TxUnicastPkts             0x1A        /* # of transmitted unicast packets */
#define MIB_TxDeferred                0x1B        /* # of transmitted deferred packets */
#define MIB_TxTotalCollision          0x1C        /* # of transmitted total collisions */
#define MIB_TxExcessiveCollision      0x1D        /* # of transmitted excessive collisions */
#define MIB_TxSingleCollision         0x1E        /* # of transmitted single collisions */
#define MIB_TxMultipleCollision       0x1F        /* # of transmitted multiple collisions */

#define READ_UNSAFE_REGISTERS         0

#endif
